cfd_sim/hull_opt/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2412                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

backgroundMesh
{
    xMin     -9.245;
    xMax     3.698;
    yMin     -7.044;
    yMax     0.0;
    zMin     -16.0;
    zMid1    -1.0;
    zMid2     0.131;
    zMid3     0.187;        //draft
    zMid4     0.243;
    zMid5     1.543;
    zMax      0.883;

    /*xCells   42;
    yCells   19;

    zCells1  10;
    zCells2  8;
    zCells3  32;
    zCells4  48;
    zCells5  40;
    zCells6  8;
    */

    xCells   18;
    yCells   7;

    zCells1  17;
    zCells2  17;
    zCells3  4;
    zCells4  4;
    zCells5  17 * (40/50);
    zCells6  17 * (20/50);
}

vertices
(
    (-26 -19 -16)
    (16 -19 -16)
    (16 0 -16)
    (-26 0 -16)

    (-26 -19 -1.0)
    (16 -19 -1.0)
    (16 0 -1.0)
    (-26 0 -1.0)

    (-26 -19 0.14)
    (16 -19 0.14)
    (16 0 0.14)
    (-26 0 0.14)

    (-26 -19 0.187)
    (16 -19 0.187)
    (16 0 0.187)
    (-26 0 0.187)

    (-26 -19 0.234)
    (16 -19 0.234)
    (16 0 0.234)
    (-26 0 0.234)

    (-26 -19 0.883)
    (16 -19 0.883)
    (16 0 0.883)
    (-26 0 0.883)

    (-26 -19 4)
    (16 -19 4)
    (16 0 4)
    (-26 0 4)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 10 20) simpleGrading (1 1 0.05)
    hex (4 5 6 7 8 9 10 11) (20 10 20) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (20 10 2) simpleGrading (1 1 1)
    hex (12 13 14 15 16 17 18 19) (20 10 2) simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23) (20 10 15) simpleGrading (1 1 1)
    hex (20 21 22 23 24 25 26 27) (20 10 10) simpleGrading (1 1 5)
);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (24 25 26 27)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
            (9 10 14 13)
            (13 14 18 17)
            (17 18 22 21)
            (21 22 26 25)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
            (8 12 15 11)
            (12 16 19 15)
            (16 20 23 19)
            (20 24 27 23)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    side
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
            (12 13 17 16)
            (16 17 21 20)
            (20 21 25 24)
        );
    }
    midPlane
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
            (7 11 10 6)
            (11 15 14 10)
            (15 19 18 14)
            (19 23 22 18)
            (23 27 26 22)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
